<h1><b>Bulove vrednosti</b></h1>
<br>
Bulove vrednosti mogu biti <i>true (ta&#269;no)</i> i <i>false (neta&#269;no)</i>.
<br>
<br>Naj&#269;e&#353;&#263;e se koriste Bulovi izrazi unutar testova, kao &#353;to je <i>if/then/else</i> iskaz.
<br>
<br>
Primer iskaza u kom je kori&#353;&#263;en Bulov izraz:
<br>
<br>
<pre class = "primer_ta" rows="3" disabled>
if(broj < 10){
&nbsp&nbsp//uradi ne&#353;to
}
</pre>
<br>
Ovaj primer slu&#382;i da poka&#382;e da li &#263;e se kod unutar zagrada izvr&#353;iti ili ne.
<br>
Ukoliko je broj manji od 10, Bulov izraz &#263;e imati vrednost <i>true</i> i kod &#263;e se izvr&#353;iti, u suprotnom ne&#263;e.
<br>
<br>
<h1><b>Null vrednosti</b></h1>
<br>
Ovo je specijalan tip podataka u JavaScriptu.
<br>
To je ni&#353;ta. Predstavlja se kao vrednost <i>false</i>.
<br>
<br>
Ne treba me&#353;ati <i>null</i> sa praznom promenljivom. Praznina i <i>null</i> vrednost se razlikuju. 
Prazna promenljiva je i dalje puna - puna je praznine.
<br>
<br>
Npr. ukoliko bismo napisali ovako ne&#353;to:  
<br><span class = "primer_text">var mojaPromenljiva=''; </span><br>to zna&#269;i da je promenljiva <i>moja Promenljiva</i> prazna, ali ona nema vrednost <i>null</i>.
<br>
<br>

<h1><b>Nedefinisane vrednosti</b></h1>
<br>
Ovo je zapravo stanje koje se koristi kao vrednost.
<br>
Koristimo ga onda kada promenljivoj nije dodeljena nikakva vrednost.
<br>
Razlikuje se od <i>null</i> vrednosti.
<br>
<br>
Primer:
<br>
<pre class = "primer_ta" rows="6"disabled>
if (number.value < 100) { 
	ispis = "Proizvod je: " + number.value;
}
else { 
	ispis = 'Rezultat je ve&#263;i od 100!';
}
</pre>
<br>
  U primeru proveravamo da li je proizvod dva uneta broja ve&#263;i ili manji od 100, ako je manji ispisujemo rezultat, a ako je ve&#263;i ispisujemo: 'Rezultat je ve&#263;i od 100!'.
<br>
<br>
<div class = "zadatak">
<b>Zadatak:</b>
Promeni program tako da unese&#353; jedan broj, proveri da li je njegov kvadrat manji od 100, ako jeste ispi&#353;i rezultat, a ako nije ispi&#353;i da je kvadrat prvog broja ve&#263;i od 100.
</div>
<br>
<br>
